[

    {
    "title":"คอมพิวเตอร์ คือ?",
    "subtitle":"ความฉลาดเทียมที่สร้างขึ้นให้กับสิ่งที่ไม่มีชีวิต...",
    "image_url":"https://raw.githubusercontent.com/chinapat/InfoAPI/main/ai.jpg",
    "detail":"ปัญญาประดิษฐ์  (AI : Artificial Intelligence)  คือเครื่องจักร (machine) ที่มีฟังก์ชันทีมีความสามารถในการทำความเข้าใจ เรียนรู้องค์ความรู้ต่างๆ อาทิเช่น การรับรู้ การเรียนรู้ การให้เหตุผล และการแก้ปัญหาต่างๆ เครื่องจักรที่มีความสามารถเหล่านี้ก็ถือว่าเป็น ปัญญาประดิษฐ์ (AI : Artificial Intelligence) นั่นเอง \n\n เพราะฉะนั้นจึงสามารถกล่าวได้ว่า AI ถือกำเนิดขึ้นเมื่อเครื่องจักรมีความสามารถที่จะเรียนรู้นั่นเอง ซึ่ง AI ก็ถูกแบ่งออกเป็นหลายระดับตามความสามารถหรือความฉลาด โดยจะวัดจากความสามารถในการ ให้เหตุผล การพูด และทัศนคติของ AI ตัวนั้นๆ เมื่อเปรียบเทียบกับมนุษย์"
},
{
    "title":"Machine Learning ?",
    "subtitle":"การศึกษาวิธีการคิด (algorithm) ที่ใช้ในการเรียนรู้...",
    "image_url":"https://raw.githubusercontent.com/chinapat/InfoAPI/main/ML.png",
    "detail":"Machine Learning คือระบบที่สามารถเรียนรู้ได้จากตัวอย่างด้วยตนเองโดยปราศจากการป้อนคำสั่งของโปรแกรมเมอร์ ความก้าวหน้าในครั้งนี้มาพร้อมกับความคิดที่ว่าเครื่องคอมพิวเตอร์สามารถเรียนรู้เพียงแค่จากข้อมูลอย่างเดียวเพื่อที่จะผลิตผลลัพธ์ที่แม่นยำออกมาได้\n\nMachine Learning ประกอบได้ด้วยข้อมูลและเครื่องมือทางสถิติเพื่อทำนาบผลลัพธ์ออกมา ผลลัพธ์ในที่นี้ถูกใช้เพื่อทำประโยชน์กับภายในองค์กรเชิงลึกต่อไป Machine Learning เกี่ยวข้องอย่างมากกับ การทำเหมืองข้อมูล (Data mining) และ โมเดลการทำนายของ Bayes ( Bayesian predictive models) เครื่องคอมพิวเตอร์จะรับข้อมูลเข้ามาและใช้อัลกอริทึมเพื่อหาคำตอบขึ้น"

},

{
    "title":"Deep Learning ?",
    "subtitle":"การทำความเข้าใจองค์ความรู้(knowledge)ในเชิงลึก...",
    "image_url":"https://raw.githubusercontent.com/chinapat/InfoAPI/main/DL.png",
    "detail":"Deep Learning คือวิธีการเรียนรู้แบบอัตโนมัติด้วยการ เลียนแบบการทำงานของโครงข่ายประสาทของมนุษย์ (Neurons) โดยนำระบบโครงข่ายประสาท (Neural Network) มาซ้อนกัน หลายชั้น (Layer) และทำการเรียนรู้ข้อมูลตัวอย่าง ซึ่งข้อมูล ดังกล่าวจะถูกนำไปใช้ในการตรวจจับรูปแบบ (Pattern) หรือจัด หมวดหมู่ข้อมูล (Classify the Data)"
},
{
    "title":"Reinforcement Learning ?",
    "subtitle":"เป็น Machine Learning Algorithm แบบหนึ่ง...",
    "image_url":"https://raw.githubusercontent.com/chinapat/InfoAPI/main/RL.jpg",
    "detail":"Reinforcement Learning เป็นวิธีการเรียนรู้แบบนึงที่โดยการเรียนรู้เกิดมาจากการปฎิสัมพันธ์ (interaction) ระหว่างผู้เรียนรู้ (agent) กับสื่งแวดล้อม (environment) ตัวอย่างของ Reinforcement Learning ได้แก่\n\nถ้าเราเกิดเป็นน้องหมาและเราหิวพอดี เราอยากจะได้อาหาร สิ่งแรกที่เราทำนั่นก็คือหันไปดูว่ามีใครอยู่ใกล้ๆบ้างนะ โอ้! เจ้าของอยู่ใกล้ๆพอดีเลย เรายืนมือออกไป ร้องขออาหารกับเจ้าของ และหลังจากเราขอแล้วสิ่งที่เราได้กลับมาคืออาหารนั่นเอง\n\nการเล่น Blackjack สมมติเราเป็นผู้เล่นและอยากจะได้เงินมากที่สุดจากการเล่น สิ่งที่เราควรทำก็คือต้องพนันอย่างเหมาะสม ถ้าช่วงไหนที่ไพ่คะแนนต่ำๆออกไปเยอะ เราก็ควรจะแทงสูงขึ้นเป็นต้น (หรือเรียกว่าเทคนิคไฮ-โลนั่นเอง)\n\nการเล่น Counter Strike ถ้าเราเป็นผู้เล่น ก็ต้องสังเกตว่ามีศตรูอยู่ใกล้ๆหรือไม่ ถ้ามีศตรูเราต้องหันไปทางศตรูและกดยิงเพื่อจะให้เราได้แต้มเยอะกว่าศตรู\n\nเวลาเราแชทกับสาว เราควรจะแชทยังไงให้บทสนทนายาวนานและทำให้สาวแชทกับเราได้นานที่สุด"
}

]



          
